# Task 4.9 - Part 1

In [ ]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
path = r'C:\Users\RebekkaBrandt\Documents\Instacart Basket Analysis'

In [3]:
# import file
df_cust = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'), index_col = False)

## Data Wrangling

In [ ]:
df_cust.shape

In [ ]:
df_cust.head()

In [4]:
# renaming columns
df_cust.rename(columns = {'First Name' : 'first_name', 'Surnam' : 'last_name', 'Gender' : 'gender', 'STATE': 'state', 'Age': 'age', 'n_dependants' : 'number_of_dependants', 'fam_status': 'family_status' }, inplace = True)

In [ ]:
df_cust.head()

At this point no data is dropped as it is not yet clear what data will be needed

## Consitency Check

In [ ]:
df_cust.info()

Note the missing values in first_name

In [ ]:
df_cust.describe()

Nothing out of the ordinary

In [ ]:
# find missing values
df_cust.isnull().sum()

In [ ]:
df_cust[df_cust['first_name'].isnull() == True]

11259 missing fist names - as other data exists this will not be dropped

In [ ]:
# checking for duplicats
df_cust[df_cust.duplicated()]

No duplicates found

In [ ]:
# check for mixed type columns
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

In [ ]:
# change data type for first name to string
df_cust['first_name'] = df_cust['first_name'].astype('str')

In [ ]:
df_cust.shape

In [ ]:
# Export Data
df_cust.to_csv(os.path.join(path, '02 Data','Prepared Data', 'customers_cleaned.csv'))

## Combining data

In [5]:
# Import orders_products_merged.pkl
df_orders_prods_merged = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged_5sm.pkl'))

In [7]:
# searching for key column
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
df_orders_prods_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order,product_id,add_to_cart_order,reordered,product_name,...,busiest_days,busiest_peripd_of_day,busiest_period_of_day,max_order,loyalty_flag,avg_price,spending_flag,order_freq,frequency,frequency_flag
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Regularly busy days,Average Orders,Average Orders,10,New customer,6.367188,Low Spender,20.5,NaN,Non-frequent customer
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Least busy days,Average Orders,Average Orders,10,New customer,6.367188,Low Spender,20.5,NaN,Non-frequent customer
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Least busy days,Most Orders,Most Orders,10,New customer,6.367188,Low Spender,20.5,NaN,Non-frequent customer
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Least busy days,Average Orders,Average Orders,10,New customer,6.367188,Low Spender,20.5,NaN,Non-frequent customer
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Least busy days,Most Orders,Most Orders,10,New customer,6.367188,Low Spender,20.5,NaN,Non-frequent customer

In [9]:
#checking data type
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   first_name            194950 non-null  object
 2   last_name             206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   date_joined           206209 non-null  object
 7   number_of_dependants  206209 non-null  int64
 8   family_status         206209 non-null  object
 9   income                206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [10]:
df_orders_prods_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 26 columns):
 #   Column                     Dtype
---  ------                     -----
 0   order_id                   int32
 1   user_id                    int32
 2   order_number               int8
 3   orders_day_of_week         int8
 4   order_hour_of_day          int8
 5   days_since_previous_order  float16
 6   product_id                 int32
 7   add_to_cart_order          int32
 8   reordered                  int8
 9   product_name               object
 10  aisle_id                   int8
 11  department_id              int8
 12  prices                     float16
 13  _merge                     category
 14  price_range_loc            object
 15  busiest_day                object
 16  busiest_days               object
 17  busiest_peripd_of_day      object
 18  busiest_period_of_day      object
 19  max_order                  int8
 20  loyalty_flag               object
 21  avg_price                  float16
 22  spending_flag              object
 23  order_freq                 float16
 24  frequency                  object
 25  frequency_flag             object
dtypes: category(1), float16(4), int32(4), int8(7), object(10)
memory usage: 3.6+ GB

In [11]:
#changing datatype
df_cust['user_id'] = df_cust['user_id'].astype('int32')
df_cust['age'] = df_cust['age'].astype('int8')
df_cust['number_of_dependants'] = df_cust['number_of_dependants'].astype('int8')
df_cust['income'] = df_cust['income'].astype('int32')

In [12]:
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [13]:
#checking data type
df_cust.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int32
 1   first_name            194950 non-null  object
 2   last_name             206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int8
 6   date_joined           206209 non-null  object
 7   number_of_dependants  206209 non-null  int8
 8   family_status         206209 non-null  object
 9   income                206209 non-null  int32
dtypes: int32(2), int8(2), object(6)
memory usage: 11.4+ MB

In [14]:
# merging data
df_merged = df_orders_prods_merged.merge(df_cust, on = 'user_id', how = 'outer')

In [15]:
#checking merge
df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [16]:
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_previous_order,product_id,add_to_cart_order,reordered,product_name,...,frequency_flag,first_name,last_name,gender,state,age,date_joined,number_of_dependants,family_status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [17]:
df_merged.shape

(32404859, 35)

In [18]:
# Export Data
df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_all.pkl'))